__Pandas__

create a simple dataset with dictionary :

In [ ]:
my_dict = {
    'name': ["a", "b", "c", "d", "e","f", "g"],
    'age': [20,27, 35, 55, 18, 21, 35],
    'designation': ["VP", "CEO", "CFO", "VP", "VP", "CEO", "MD"]
}

In [2]:
my_dict

{'name': ['a', 'b', 'c', 'd', 'e', 'f', 'g'],
 'age': [20, 27, 35, 55, 18, 21, 35],
 'designation': ['VP', 'CEO', 'CFO', 'VP', 'VP', 'CEO', 'MD']}

In [3]:
import pandas as pd

df = pd.DataFrame(my_dict)

In [4]:
df

  name  age designation
0    a   20          VP
1    b   27         CEO
2    c   35         CFO
3    d   55          VP
4    e   18          VP
5    f   21         CEO
6    g   35          MD

In [5]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\asus\anaconda3\lib\site-packages (0.23.0)
Requirement already satisfied: python-dateutil>=2.5.0 in c:\users\asus\anaconda3\lib\site-packages (from pandas) (2.7.3)
Requirement already satisfied: pytz>=2011k in c:\users\asus\anaconda3\lib\site-packages (from pandas) (2018.4)
Requirement already satisfied: numpy>=1.9.0 in c:\users\asus\anaconda3\lib\site-packages (from pandas) (1.14.3)
Requirement already satisfied: six>=1.5 in c:\users\asus\anaconda3\lib\site-packages (from python-dateutil>=2.5.0->pandas) (1.11.0)

You are using pip version 18.0, however version 18.1 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

In [18]:
df = pd.DataFrame(my_dict, index=["First", "Second", "Third", "Fourth", "Fifth", "Sixth", "Seventh"])

In [20]:
df[["age", 'name']]

         age name
First     20    a
Second    27    b
Third     35    c
Fourth    55    d
Fifth     18    e
Sixth     21    f
Seventh   35    g

In [8]:
df['age'].dtype

dtype('int64')

In [9]:
df.index

Index(['First', 'Second', 'Third', 'Fourth', 'Fifth', 'Sixth', 'Seventh'], dtype='object')

In [10]:
df.columns

Index(['name', 'age', 'designation'], dtype='object')

In [11]:
df.head

<bound method NDFrame.head of         name  age designation
First      a   20          VP
Second     b   27         CEO
Third      c   35         CFO
Fourth     d   55          VP
Fifth      e   18          VP
Sixth      f   21         CEO
Seventh    g   35          MD>

In [12]:
df.head()

       name  age designation
First     a   20          VP
Second    b   27         CEO
Third     c   35         CFO
Fourth    d   55          VP
Fifth     e   18          VP

In [13]:
df.head(6)

       name  age designation
First     a   20          VP
Second    b   27         CEO
Third     c   35         CFO
Fourth    d   55          VP
Fifth     e   18          VP
Sixth     f   21         CEO

In [14]:
df.tail()

        name  age designation
Third      c   35         CFO
Fourth     d   55          VP
Fifth      e   18          VP
Sixth      f   21         CEO
Seventh    g   35          MD

In [15]:
df.age.mean()

30.142857142857142

In [16]:
df = pd.DataFrame(my_dict, columns=['name','age'])

In [17]:
df

  name  age
0    a   20
1    b   27
2    c   35
3    d   55
4    e   18
5    f   21
6    g   35

__If you want to read more about Pandas, check out these resources:__